[
  {
    "id": "analyse-impressum",
    "title": "AI Enrichment Workflow",
    "image": "images/analyse-impressum.png",
    "description": "Automated analysis and enrichment of leads. Deterministic email capture, AI personalization and enrichment.",
    "writeup": "This case study demonstrates how we optimized a lead enrichment system, taking advantage of the Impressum standard in european markets."
  },
  {
    "id": "booking-follow-up-automation",
    "title": "Automated Booking Follow-up System",
    "image": "images/booking-follow-up-automation.png",
    "description": "Smart automation system for managing booking confirmations, reminders, and follow-up communications.",
    "writeup": "We developed a comprehensive booking automation system that handles the entire customer journey from initial booking through post-service follow-up. The system reduces manual work by 85% while improving customer satisfaction scores."
  },
  {
    "id": "invoice-generator",
    "title": "AI-Powered Invoice Generator",
    "image": "images/invoice-generator.png",
    "description": "Intelligent invoice generation system that automates billing processes and integrates with existing accounting workflows.",
    "writeup": "A system that.."
  },
  {
    "id": "runpod-comfyui",
    "title": "Cloud-Based AI Image Processing",
    "image": "images/runpod-comfyui.png",
    "description": "Scalable cloud infrastructure for AI image processing using RunPod and ComfyUI integration.",
    "writeup": "."
  },
  {
    "id": "voice-photo-text-ai-agent",
    "title": "Multimodal AI Assistant",
    "image": "images/voice-photo-text-ai-agent.png",
    "description": "Advanced AI agent capable of processing voice, images, and text inputs for comprehensive user interaction.",
    "writeup": "multimodal AI assistant that represents the cutting edge of conversational AI technology. The system seamlessly processes voice commands, analyzes uploaded images, and maintains context across different input modalities to provide intelligent, contextual responses."
  },
  {
    "id": "webinar-faq-rag",
    "title": "Webinar FAQ RAG System",
    "image": "images/webinar-faq-rag.png",
    "description": "Retrieval-Augmented Generation system for automatically answering webinar-related questions.",
    "writeup": "An intelligent FAQ system that uses RAG technology to provide accurate answers to webinar participants. The system dramatically reduces moderator workload while ensuring attendees receive immediate, relevant responses to their questions."
  },
  {
    "id": "wordpress-blog-generator",
    "title": "WordPress Blog Content Generator",
    "image": "images/wordpress-blog-generator.png",
    "description": "Automated blog content generation system that creates SEO-optimized WordPress posts.",
    "writeup": "Our WordPress blog generator revolutionizes content creation by automatically producing high-quality, SEO-optimized blog posts. The system integrates seamlessly with existing WordPress installations and maintains brand voice consistency across all generated content."
  }
]
